app/controllers/school_classes_controller.rb

SELECT "school_classes".* FROM "school_classes"
---
  def index
    @school_classes = SchoolClass.all

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "asdf"], ["room_number", 0]]
---
  def create
    @school_class = SchoolClass.new(params.require(:school_class).permit(:title, :room_number))
    @school_class.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "room_number" = ? WHERE "school_classes"."id" = ?  [["room_number", 0], ["id", 1]]
---
  def update
      @school_class = SchoolClass.find(params[:id])
      @school_class.update(params.require(:school_class).permit(:title, :room_number))