app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "asdf"], ["last_name", "asfd"], ["created_at", "2018-07-28 22:13:41.685924"], ["updated_at", "2018-07-28 22:13:41.685924"]]
---
  def create

    @student = Student.new(params.require(:student).permit(:first_name, :last_name))
    @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 4]]
---
  def update
    @student = Student.find(params[:id])